In [42]:
# Import modules
import pandas as pd
import numpy as np

In [43]:
# Read names into a dataframe: bnames
bnames=pd.read_csv('names.csv')
bnames.head()

        name sex  births  year
0       Mary   F    7065  1880
1       Anna   F    2604  1880
2       Emma   F    2003  1880
3  Elizabeth   F    1939  1880
4     Minnie   F    1746  1880

In [44]:
df_numbers=pd.DataFrame()
df_numbers['A']=[1,2,3,4,5]
df_numbers['B']=[10,20,30,40,50]
df_numbers['C']=[15,np.nan,35,45,55]
df_numbers['D']=[0,0,37,47,0]
print(df_numbers)

   A   B     C   D
0  1  10  15.0   0
1  2  20   NaN   0
2  3  30  35.0  37
3  4  40  45.0  47
4  5  50  55.0   0

In [45]:
bnames.shape

(1891894, 4)

In [46]:
bnames.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1891894 entries, 0 to 1891893
Data columns (total 4 columns):
name      object
sex       object
births    int64
year      int64
dtypes: int64(2), object(2)
memory usage: 57.7+ MB

In [47]:
bnames.columns

Index(['name', 'sex', 'births', 'year'], dtype='object')

In [48]:
bnames.describe()

             births          year
count  1.891894e+06  1.891894e+06
mean   1.821106e+02  1.974122e+03
std    1.544197e+03  3.386497e+01
min    5.000000e+00  1.880000e+03
25%    7.000000e+00  1.951000e+03
50%    1.200000e+01  1.984000e+03
75%    3.200000e+01  2.002000e+03
max    9.968500e+04  2.016000e+03

In [49]:
bnames.name.value_counts().head()

Jessie     274
William    274
Leslie     274
Tommie     274
James      274
Name: name, dtype: int64

In [50]:
bnames.name.value_counts(dropna=False).head()

Jessie     274
William    274
Leslie     274
Tommie     274
James      274
Name: name, dtype: int64

In [51]:
bnames['name'].value_counts(dropna=False).head()

Jessie     274
William    274
Leslie     274
Tommie     274
James      274
Name: name, dtype: int64

In [52]:
bnames.describe()

             births          year
count  1.891894e+06  1.891894e+06
mean   1.821106e+02  1.974122e+03
std    1.544197e+03  3.386497e+01
min    5.000000e+00  1.880000e+03
25%    7.000000e+00  1.951000e+03
50%    1.200000e+01  1.984000e+03
75%    3.200000e+01  2.002000e+03
max    9.968500e+04  2.016000e+03

In [53]:
bnames['births'].describe()

count    1.891894e+06
mean     1.821106e+02
std      1.544197e+03
min      5.000000e+00
25%      7.000000e+00
50%      1.200000e+01
75%      3.200000e+01
max      9.968500e+04
Name: births, dtype: float64

In [54]:
top5=bnames.head(5).copy()
top5['Char']=top5['name'].astype(str).str[0]
top5=top5.set_index('name')
print(top5)

          sex  births  year Char
name
Mary        F    7065  1880    M
Anna        F    2604  1880    A
Emma        F    2003  1880    E
Elizabeth   F    1939  1880    E
Minnie      F    1746  1880    M

In [55]:
top5=bnames.head(5).copy()
top5['Char']=top5.name.str[0]
top5=top5.set_index('name')
print(top5)

          sex  births  year Char
name
Mary        F    7065  1880    M
Anna        F    2604  1880    A
Emma        F    2003  1880    E
Elizabeth   F    1939  1880    E
Minnie      F    1746  1880    M

In [56]:
# Selecting value from the DataFrame

In [57]:
print(top5.loc[:])

          sex  births  year Char
name
Mary        F    7065  1880    M
Anna        F    2604  1880    A
Emma        F    2003  1880    E
Elizabeth   F    1939  1880    E
Minnie      F    1746  1880    M

In [58]:
df=top5.loc[::2]
print(df)

       sex  births  year Char
name
Mary     F    7065  1880    M
Emma     F    2003  1880    E
Minnie   F    1746  1880    M

In [59]:
df=top5.loc[::-1]
print(df)

          sex  births  year Char
name
Minnie      F    1746  1880    M
Elizabeth   F    1939  1880    E
Emma        F    2003  1880    E
Anna        F    2604  1880    A
Mary        F    7065  1880    M

In [60]:
df=top5.loc[::-1]
print(df)

          sex  births  year Char
name
Minnie      F    1746  1880    M
Elizabeth   F    1939  1880    E
Emma        F    2003  1880    E
Anna        F    2604  1880    A
Mary        F    7065  1880    M

In [61]:
df=top5['births']['Minnie']
print(df)

1746

In [62]:
df=top5.births['Minnie']
print(df)

1746

In [63]:
df=top5.loc['Minnie','births']
print(df)

1746

In [64]:
# births is the 2nd column, Minnie is the last element
df=top5.iloc[-1,1]
print(df)

1746

In [65]:
# Filtering

In [66]:
df=bnames['name'].str.contains('th').head(10)
print(df)

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7    False
8     True
9    False
Name: name, dtype: bool

In [67]:
df=bnames[bnames['name'].str.contains('th')].head(10)
print(df)

          name sex  births  year
3    Elizabeth   F    1939  1880
8       Bertha   F    1320  1880
15      Martha   F    1040  1880
27       Edith   F     768  1880
30   Catherine   F     688  1880
37       Ethel   F     633  1880
52   Katherine   F     502  1880
92        Ruth   F     234  1880
102    Kathryn   F     204  1880
103     Esther   F     198  1880

In [68]:
df=top5.loc['Minnie']
print(df)

sex          F
births    1746
year      1880
Char         M
Name: Minnie, dtype: object

In [69]:
df=top5.loc['Mary':'Anna']
print(df)

     sex  births  year Char
name
Mary   F    7065  1880    M
Anna   F    2604  1880    A

In [70]:
df=top5.loc['Mary', 'births':'year']
print(df)

births    7065
year      1880
Name: Mary, dtype: object

In [71]:
# select all column with all nonzeros
print(df_numbers)
print(df_numbers.loc[:, df_numbers.all()])

   A   B     C   D
0  1  10  15.0   0
1  2  20   NaN   0
2  3  30  35.0  37
3  4  40  45.0  47
4  5  50  55.0   0
   A   B     C
0  1  10  15.0
1  2  20   NaN
2  3  30  35.0
3  4  40  45.0
4  5  50  55.0

In [72]:
# select all column with any nonezeros
print(df_numbers)
print(df_numbers.loc[:, df_numbers.any()])

   A   B     C   D
0  1  10  15.0   0
1  2  20   NaN   0
2  3  30  35.0  37
3  4  40  45.0  47
4  5  50  55.0   0
   A   B     C   D
0  1  10  15.0   0
1  2  20   NaN   0
2  3  30  35.0  37
3  4  40  45.0  47
4  5  50  55.0   0

In [73]:
# select all columns with any NaNs
print(df_numbers)
print(df_numbers.loc[:, df_numbers.isnull().any()])

   A   B     C   D
0  1  10  15.0   0
1  2  20   NaN   0
2  3  30  35.0  37
3  4  40  45.0  47
4  5  50  55.0   0
      C
0  15.0
1   NaN
2  35.0
3  45.0
4  55.0

In [74]:
# select all columns without NaNs
print(df_numbers)
print(df_numbers.loc[:, df_numbers.notnull().all()])

   A   B     C   D
0  1  10  15.0   0
1  2  20   NaN   0
2  3  30  35.0  37
3  4  40  45.0  47
4  5  50  55.0   0
   A   B   D
0  1  10   0
1  2  20   0
2  3  30  37
3  4  40  47
4  5  50   0

In [75]:
df_numbers2=df_numbers.copy()
df_numbers2.dropna(how='all')
print(df_numbers)
print(df_numbers2)

   A   B     C   D
0  1  10  15.0   0
1  2  20   NaN   0
2  3  30  35.0  37
3  4  40  45.0  47
4  5  50  55.0   0
   A   B     C   D
0  1  10  15.0   0
1  2  20   NaN   0
2  3  30  35.0  37
3  4  40  45.0  47
4  5  50  55.0   0

In [76]:
# working with indexes

In [77]:
df=bnames.head().copy()
print(df)

        name sex  births  year
0       Mary   F    7065  1880
1       Anna   F    2604  1880
2       Emma   F    2003  1880
3  Elizabeth   F    1939  1880
4     Minnie   F    1746  1880

In [78]:
#Set index name to the name column and create upper index elements
# in that way the name column will appear only once as index column
df=df.set_index('name')
df.index=df.index.map(str.upper)
print(df)

          sex  births  year
name
MARY        F    7065  1880
ANNA        F    2604  1880
EMMA        F    2003  1880
ELIZABETH   F    1939  1880
MINNIE      F    1746  1880

In [79]:
df.index=df.index.str.lower()
print(df)

          sex  births  year
name
mary        F    7065  1880
anna        F    2604  1880
emma        F    2003  1880
elizabeth   F    1939  1880
minnie      F    1746  1880

In [80]:
#other way to create upper index values
# Create the list of new indexes: new_idx
new_idx = [i.upper() for i in df.index]

# Assign new_idx to sales.index
df.index = new_idx

print(df)

          sex  births  year
MARY        F    7065  1880
ANNA        F    2604  1880
EMMA        F    2003  1880
ELIZABETH   F    1939  1880
MINNIE      F    1746  1880

In [81]:
#Other way to set index
# in that way the name column will appear twice, one as an index column and once as a normal column.
df3=bnames.head().copy()
print(df3)

        name sex  births  year
0       Mary   F    7065  1880
1       Anna   F    2604  1880
2       Emma   F    2003  1880
3  Elizabeth   F    1939  1880
4     Minnie   F    1746  1880

In [82]:
df3.index=df3['name']
print(df3)

                name sex  births  year
name
Mary            Mary   F    7065  1880
Anna            Anna   F    2604  1880
Emma            Emma   F    2003  1880
Elizabeth  Elizabeth   F    1939  1880
Minnie        Minnie   F    1746  1880

In [83]:
# we can delete this column
del df3['name']
print(df3)

          sex  births  year
name
Mary        F    7065  1880
Anna        F    2604  1880
Emma        F    2003  1880
Elizabeth   F    1939  1880
Minnie      F    1746  1880

In [84]:
#Rename the index column
df2=bnames.head().copy()
print(df2)

        name sex  births  year
0       Mary   F    7065  1880
1       Anna   F    2604  1880
2       Emma   F    2003  1880
3  Elizabeth   F    1939  1880
4     Minnie   F    1746  1880

In [85]:
df2.index.name='name again'
print(df2)

                 name sex  births  year
name again
0                Mary   F    7065  1880
1                Anna   F    2604  1880
2                Emma   F    2003  1880
3           Elizabeth   F    1939  1880
4              Minnie   F    1746  1880

In [86]:
df2.columns.name='own col names'
print(df2)

own col names       name sex  births  year
name again
0                   Mary   F    7065  1880
1                   Anna   F    2604  1880
2                   Emma   F    2003  1880
3              Elizabeth   F    1939  1880
4                 Minnie   F    1746  1880

In [87]:
#Set touple index or multi index
df4=bnames.head().copy()
print(df4)

        name sex  births  year
0       Mary   F    7065  1880
1       Anna   F    2604  1880
2       Emma   F    2003  1880
3  Elizabeth   F    1939  1880
4     Minnie   F    1746  1880

In [88]:
df4=df4.set_index(['name','sex'])
print(df4)

               births  year
name      sex
Mary      F      7065  1880
Anna      F      2604  1880
Emma      F      2003  1880
Elizabeth F      1939  1880
Minnie    F      1746  1880

In [139]:
# Reach multi indexed data
df_multi=bnames.head().copy()
df_multi=df_multi.set_index(['name','year'])
print(df_multi.head())

               sex  births
name      year
Mary      1880   F    7065
Anna      1880   F    2604
Emma      1880   F    2003
Elizabeth 1880   F    1939
Minnie    1880   F    1746

In [134]:
df_multi_1= df_multi.loc[('Mary', 1880),:]
print(df_multi_1)

sex          F
births    7065
Name: (Mary, 1880), dtype: object

In [141]:
#df_multi_2= df_multi.loc[(slice(None),1880),:]
#print(df_multi_2)

In [142]:
df_multi_3=df_multi.loc[idx['Mary',:],:]

NameError: name 'idx' is not defined

In [91]:
# Querying the DataFrame

In [92]:
# select * where name = Isabella
df=bnames[bnames['name']=='Isabella']
print(df.head(20))

           name sex  births  year
214    Isabella   F      50  1880
2217   Isabella   F      50  1881
4197   Isabella   F      44  1882
6306   Isabella   F      54  1883
8361   Isabella   F      76  1884
10733  Isabella   F      48  1885
12965  Isabella   F      80  1886
15408  Isabella   F      58  1887
17800  Isabella   F      63  1888
20415  Isabella   F      80  1889
23005  Isabella   F      91  1890
25716  Isabella   F      79  1891
28382  Isabella   F      88  1892
31270  Isabella   F     109  1893
34137  Isabella   F      92  1894
37096  Isabella   F      90  1895
40150  Isabella   F      88  1896
43244  Isabella   F      86  1897
46294  Isabella   F      86  1898
49528  Isabella   F      94  1899

In [93]:
# select * where name=Isabella and births>= 2011
df=bnames.loc[((bnames['name']=='Isabella') & (bnames['year']>=2011))]
print(df)

             name sex  births  year
1691897  Isabella   F   19891  2011
1715378  Isabella   M      26  2011
1725791  Isabella   F   19089  2012
1750378  Isabella   M      18  2012
1759507  Isabella   F   17617  2013
1783755  Isabella   M      18  2013
1792760  Isabella   F   17054  2014
1816677  Isabella   M      20  2014
1825967  Isabella   F   15574  2015
1849600  Isabella   M      21  2015
1859030  Isabella   F   14722  2016
1885053  Isabella   M      11  2016

In [94]:
# select name where births=19891
df=bnames['name'][bnames['births']==19891]
print(df)

628867      Gregory
1691897    Isabella
Name: name, dtype: object

In [95]:
# bnames_top5: A dataframe with top 5 popular male and female names for the decade
# select sex, name, births where the 2011 after birth
top5 = bnames[bnames['year']>=2011].loc[:,['sex','name','births']]
print(top5.head(20))

        sex       name  births
1691896   F     Sophia   21833
1691897   F   Isabella   19891
1691898   F       Emma   18791
1691899   F     Olivia   17315
1691900   F        Ava   15491
1691901   F      Emily   14247
1691902   F    Abigail   13245
1691903   F    Madison   12374
1691904   F        Mia   11525
1691905   F      Chloe   10983
1691906   F  Elizabeth   10078
1691907   F       Ella    9585
1691908   F    Addison    9295
1691909   F    Natalie    8633
1691910   F       Lily    8176
1691911   F      Grace    7629
1691912   F   Samantha    7392
1691913   F      Avery    7337
1691914   F      Sofia    7325
1691915   F     Aubrey    7171

In [96]:
# create two distinct group 
f=top5[top5['sex']=='F']
m=top5[top5['sex']=='M']
print(f.head(5))
print(m.head(5))

        sex      name  births
1691896   F    Sophia   21833
1691897   F  Isabella   19891
1691898   F      Emma   18791
1691899   F    Olivia   17315
1691900   F       Ava   15491
        sex     name  births
1711450   M    Jacob   20356
1711451   M    Mason   19503
1711452   M  William   17331
1711453   M   Jayden   16979
1711454   M     Noah   16848

In [97]:
# aggregate the birth by name
f_agg=f.groupby(['name','sex']).agg('sum')#.sort('births',ascending=False)
m_agg=m.groupby(['name','sex']).agg('sum')#.sort('births',ascending=False)
print(f_agg.head(20))

               births
name      sex
Aabha     F        35
Aabriella F        21
Aada      F         5
Aadhira   F        51
Aadhvika  F         9
Aadhya    F      1132
Aadi      F        11
Aadison   F         5
Aaditri   F        32
Aadrika   F        19
Aadriti   F         5
Aadvi     F         7
Aadvika   F        33
Aadya     F       728
Aafia     F         6
Aafiya    F         6
Aafiyah   F         5
Aagna     F         7
Aahana    F       278
Aahna     F        58

In [98]:
# select the top 5 in each group
f_agg_top5=f_agg.head(5).copy()
m_agg_top5=m_agg.head(5).copy()
print(m_agg_top5)

           births
name  sex
Aaban M        76
Aabid M         5
Aabir M         5
Aadam M       103
Aadan M        53

In [99]:
# concat the groups
frames=[f_agg_top5, m_agg_top5]
bnames_top5=pd.concat(frames)
print(bnames_top5)

               births
name      sex
Aabha     F        35
Aabriella F        21
Aada      F         5
Aadhira   F        51
Aadhvika  F         9
Aaban     M        76
Aabid     M         5
Aabir     M         5
Aadam     M       103
Aadan     M        53

In [100]:
#print(bnames_top5)
#bnames_top5=bnames_top5.loc[:,['sex','name','births']]
bnames_top5 = bnames_top5.reset_index()
print(bnames_top5.loc[:].to_string(index=False))

name sex  births
    Aabha   F      35
Aabriella   F      21
     Aada   F       5
  Aadhira   F      51
 Aadhvika   F       9
    Aaban   M      76
    Aabid   M       5
    Aabir   M       5
    Aadam   M     103
    Aadan   M      53

In [101]:
# calculation like sum, avg, percentage
# Percentage 1 = value 1 / Sum (eg: 50/90 on hungary)
# Percentage 2 = value 1 / sum of column (eg: 50/260)
# Percentage 3 = value 1 / total sum (eg: 50/400)

In [102]:
xlsFile='ExcelToLoad.xlsx'
xl = pd.ExcelFile(xlsFile)
# calculated fields: sum, percentage, percentage 2, percentage 3
df_result = xl.parse('data final')
print(df_result)

    ID  Country  Value 1  Value 2  Sum  Percentage 1  Percentage 2  \
0  1.0  Hungary       50       40   90      0.555556      0.192308
1  2.0  Germany      100       30  130      0.769231      0.384615
2  3.0  England       40       20   60      0.666667      0.153846
3  4.0      USA       70       50  120      0.583333      0.269231
4  NaN      NaN      260      140  400           NaN           NaN

   Percentage 3
0         0.125
1         0.250
2         0.100
3         0.175
4           NaN

In [103]:
df = xl.parse('data')
print(df)

   ID  Country  Value 1  Value 2
0   1  Hungary       50       40
1   2  Germany      100       30
2   3  England       40       20
3   4      USA       70       50

In [104]:
# Melt the data from column base into one table base
# The id_vars represent the columns of the data you do not want to melt
# value_vars represent the columns you do wish to melt into rows
dfmelt=pd.melt(frame=df, id_vars='Country', value_vars=['Value 1', 'Value 2'])
print(dfmelt)

   Country variable  value
0  Hungary  Value 1     50
1  Germany  Value 1    100
2  England  Value 1     40
3      USA  Value 1     70
4  Hungary  Value 2     40
5  Germany  Value 2     30
6  England  Value 2     20
7      USA  Value 2     50

In [105]:
# Rename the columns
dfmelt.columns = ['country new', 'variable new', 'value new']
print(dfmelt)

  country new variable new  value new
0     Hungary      Value 1         50
1     Germany      Value 1        100
2     England      Value 1         40
3         USA      Value 1         70
4     Hungary      Value 2         40
5     Germany      Value 2         30
6     England      Value 2         20
7         USA      Value 2         50

In [106]:
#re-name the columns in the melt
dfmelt=pd.melt(frame=df, id_vars='Country', value_vars=['Value 1', 'Value 2'], var_name='Values', value_name='measures')
print(dfmelt)

   Country   Values  measures
0  Hungary  Value 1        50
1  Germany  Value 1       100
2  England  Value 1        40
3      USA  Value 1        70
4  Hungary  Value 2        40
5  Germany  Value 2        30
6  England  Value 2        20
7      USA  Value 2        50

In [107]:
# Pivoting data opposite of melting
dfpivot=dfmelt.pivot_table(index='Country', columns='Values', values='measures')
dfpivot=dfpivot.reset_index()
print(dfpivot.head())

Values  Country  Value 1  Value 2
0       England       40       20
1       Germany      100       30
2       Hungary       50       40
3           USA       70       50

In [108]:
# Sum of Value 1 sum, mean, min, max are the same
sum=df['Value 1'].sum()
print(sum)

260

In [109]:
#Sum of values per country
sum=df['Value 1']+df['Value 2']
print(sum)

0     90
1    130
2     60
3    120
dtype: int64

In [110]:
#Sum of values per country to Hungary
sum=df['Value 1']+df['Value 2']
print(sum[0])

90

In [111]:
#Sum of values per country
sum=(df['Value 1']+df['Value 2']).sum()
print(sum)

400

In [112]:
# Percentage 1
perc1=df['Value 1'] / (df['Value 1']+df['Value 2'])
print(perc1)

0    0.555556
1    0.769231
2    0.666667
3    0.583333
dtype: float64

In [113]:
# Percentage 2
perc2=df['Value 1'] / df['Value 1'].sum()
print(perc2)

0    0.192308
1    0.384615
2    0.153846
3    0.269231
Name: Value 1, dtype: float64

In [114]:
# Percentage 3
perc3=df['Value 1'] / (df['Value 1']+df['Value 2']).sum()
print(perc3)

0    0.125
1    0.250
2    0.100
3    0.175
Name: Value 1, dtype: float64

In [115]:
# using function on the dataframe

In [116]:
# def my_function(param1, param2)
# ....
# df['col name]=df.apply(my_function, axis=1)
# axis = 1 column
# axis = 0 row

In [117]:
print(df_numbers.head())

   A   B     C   D
0  1  10  15.0   0
1  2  20   NaN   0
2  3  30  35.0  37
3  4  40  45.0  47
4  5  50  55.0   0

In [118]:
print(df_numbers.apply(lambda n: n//2))

   A   B     C   D
0  0   5   7.0   0
1  1  10   NaN   0
2  1  15  17.0  18
3  2  20  22.0  23
4  2  25  27.0   0

In [119]:
print(np.floor_divide(df_numbers, 2))

     A     B     C     D
0  0.0   5.0   7.0  -0.0
1  1.0  10.0   NaN  -0.0
2  1.0  15.0  17.0  18.0
3  2.0  20.0  22.0  23.0
4  2.0  25.0  27.0  -0.0

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: RuntimeWarning: invalid value encountered in floor_divide
  """Entry point for launching an IPython kernel.

In [120]:
def dozens(n):
    return n//2

print(df_numbers.apply(dozens))

   A   B     C   D
0  0   5   7.0   0
1  1  10   NaN   0
2  1  15  17.0  18
3  2  20  22.0  23
4  2  25  27.0   0

In [121]:
df_numbers['E']= df_numbers.B.floordiv(2)
print(df_numbers.head())

   A   B     C   D   E
0  1  10  15.0   0   5
1  2  20   NaN   0  10
2  3  30  35.0  37  15
3  4  40  45.0  47  20
4  5  50  55.0   0  25

In [122]:
#Converting types

In [123]:
# df.dtypes
# df['my col']=df['my col'].to_numeric()
# df.mycol = pd.to_numeric(df.mycol)
# df['my col']=df['my col'].astype(str)

In [124]:
# Check the type are correct or not

In [125]:
#assert df.mycol.dtypes == np.object
#assert df.mycol.dtypes == np.int64
#assert df.mycol.dtypes == np.float

In [126]:
# attributes and methods list
# https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html